//题目内容：编写程序，从键盘输入任意一个3位正整数，判断是否"水仙花数"。若是水仙花数，则输出"该三位数是水仙花数！"，否则输出“该三位数不是水仙花数！”。
//提示：所谓"水仙花数"是指一3位数，其各位数字立方和等于该数本身。例如：153是一个水仙花数，因为153=1+125+27。
//输入格式:%d
//输出格式：
//输入样例：//153
//输出样例：153是水仙花数！
//
#include<stdio.h>

int main()
{
	int input = 0,a = 0,b = 0,c = 0;

	scanf("%d",&input);

	a = input / 100;
	b = (input - a * 100) /10;
	c = input - a * 100 - b * 10;

	if(input == a * a * a + b * b * b + c * c * c)
	{
		printf("%d是水仙花数！\n",input);
	}
	else
	{
		printf("%d不是水仙花数！\n",input);
	}

	return 0;
}